IDEA StatiCa Open Model
Member1D.HingeBegin Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets, sets hinge located in the begining of element
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReferenceElement HingeBegin { get; set; }
Public Property HingeBegin As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ HingeBegin {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
Member1D Class
IdeaRS.OpenModel.Model Namespace